РП/src/InformationRegisters/НастройкиСтатистикиПерсонала/НастройкиСтатистикиПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСтатистикиПерсонала</name>
  <resources>
    <name>ИспользоватьОтчетностьМониторингаРаботниковСоциальнойСферы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормаОтчетностиМониторингаРаботниковСоциальнойСферы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

РП/src/Enums/ВидыЗанятости/ВидыЗанятости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятости</name>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
  <enumValues>
    <name>Подработка</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/СостоянияСотрудника/СостоянияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСотрудника</name>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>РаботаВОтпускеПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
  <enumValues>
    <name>ВынужденныйПрогул</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботника</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ПростойНеЗависящийОтРаботодателяИРаботника</name>
  </enumValues>
  <enumValues>
    <name>ОтпускОсновной</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпускНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйОплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоРазрешениюРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоЗаконодательству</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеССохранениемОплаты</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеГосударственныхОбязанностей</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеПоНевыясненнымПричинам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНаСанаторноКурортноеЛечение</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>БолезньБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком6лет</name>
  </enumValues>
  <enumValues>
    <name>Мобилизация</name>
  </enumValues>
  <enumValues>
    <name>МобилизацияБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ПриостановкаТрудовогоДоговора</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйНаВремяВоенногоПоложения</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресТолькоРоссийский</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПоле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

РП/src/Catalogs/ПодразделенияОрганизаций/ПодразделенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодразделенияОрганизаций</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочиванияИерархического</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыСотрудников</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/CommonModules/СтатистикаПерсонала/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Статистика персонала".
// Процедуры и функции, предназначенные для обслуживания форм статистической отчетности.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область СправочникДолжности

Процедура ДополнитьФормуЭлементаСправочникаДолжности(Форма, ИмяГруппыДляВставки = "ГруппаКатегории") Экспорт
	
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// Функции для регламентированной отчетности.

// Возвращает среднесписочную численность, в т.ч. женщин и инвалидов
// 
// Параметры:
//		Организация
//		НачалоПериода
//		КонецПериода
//		ДанныеЧисленности - Структура - с полями ЧисленностьРаботников, ЧисленностьЖенщин, ЧисленностьИнвалидов.
//
Процедура СреднесписочнаяЧисленностьРаботающих(Организация, НачалоПериода, КонецПериода, ДанныеЧисленности, ИсключатьПериодыПоПравилам1ПВ = Истина,  ИсключатьТяжелыеУсловияТруда = Ложь) Экспорт

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаОтчета", НачалоПериода);
	ПараметрыОтчета.Вставить("ДатаКонцаПериодаОтчета", КонецПериода);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаВыборки", НачалоПериода);
	ПараметрыОтчета.Вставить("ИсключатьПериодыПоПравилам1ПВ", ИсключатьПериодыПоПравилам1ПВ); 
	ПараметрыОтчета.Вставить("ИсключатьТяжелыеУсловияТруда", ИсключатьТяжелыеУсловияТруда);

	// Получение данных отчета
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры("СреднесписочнаяЧисленность",
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	Если СтрокаОрганизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧислоМесяцев = 12*(Год(НачалоПериода) - Год(КонецПериода)) + Месяц(КонецПериода) - Месяц(НачалоПериода) + 1;
	
	Если ЧислоМесяцев = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеЧисленности.ЧисленностьЖенщин = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));
	ДанныеЧисленности.ЧисленностьИнвалидов = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0,Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	ДанныеЧисленности.ЧисленностьРаботников = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));	
	ДанныеЧисленности.ЧисленностьВнешнихСовместителей = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьВнешнихСовместителей), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьВнешнихСовместителей/ЧислоМесяцев, 5)));	
	ДанныеЧисленности.ЧисленностьЧисленностьРаботниковГПХ = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьРаботниковГПХ), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьРаботниковГПХ/ЧислоМесяцев, 5)));
	ДанныеЧисленности.ЧисленностьЛицСГарантиями = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиями), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиями/ЧислоМесяцев, 5)));	
	ДанныеЧисленности.ЧисленностьЛицСГарантиямиМеньше10ЛетДоПенсии = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиямиМеньше10ЛетДоПенсии), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиямиМеньше10ЛетДоПенсии/ЧислоМесяцев, 5)));	
	ДанныеЧисленности.ЧисленностьЛицСГарантиямиНеИнвалиды = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиямиНеИнвалиды), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиямиНеИнвалиды/ЧислоМесяцев, 5)));	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГигКонтракты") Тогда
		ДанныеЧисленности.ЧисленностьРаботниковПоГигКонтракту = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьРаботниковПоГигКонтракту), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьРаботниковПоГигКонтракту/ЧислоМесяцев, 5)));
	КонецЕсли;

	
КонецПроцедуры


// Параметры:
//		Организация
//		НачалоПериода
//		КонецПериода
//		ДанныеЧисленности - Структура - с полями ЧисленностьРаботниковЭПЗВнешнихСовместителей, 
//													ЧисленностьРаботниковЭПЗОсновыныхСотрудников, 
//													ЧисленностьРаботниковЭПЗВнутреннихСовместителей
//
Процедура СреднесписочнаяЧисленностьРаботающихЭПЗ(Организация, НачалоПериода, КонецПериода, ДанныеЧисленности, ИсключатьТяжелыеУсловияТруда = Ложь) Экспорт

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаОтчета", НачалоПериода);
	ПараметрыОтчета.Вставить("ДатаКонцаПериодаОтчета", КонецПериода);
	ПараметрыОтчета.Вставить("ИсключатьТяжелыеУсловияТруда", ИсключатьТяжелыеУсловияТруда); 
	// Получение данных отчета
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадрыЭПЗ("СреднесписочнаяЧисленностьЭПЗ",
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	Если СтрокаОрганизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧислоМесяцев = 12*(Год(НачалоПериода) - Год(КонецПериода)) + Месяц(КонецПериода) - Месяц(НачалоПериода) + 1;
	
	Если ЧислоМесяцев = 0 Тогда
		Возврат;
	КонецЕсли;	         
	ДанныеОтчета = СформироватьДанныеССЧЭПЗ(СтрокаОрганизации, Организация, НачалоПериода, КонецПериода, ИсключатьТяжелыеУсловияТруда);	
	ДанныеЧисленности.ЧисленностьРаботниковЭПЗВнешнихСовместителей = ДанныеОтчета.ЧисленностьРаботниковЭПЗВнешнихСовместителей;
	ДанныеЧисленности.ЧисленностьРаботниковЭПЗОсновыныхСотрудников = ДанныеОтчета.ЧисленностьРаботниковЭПЗОсновыныхСотрудников;	
	ДанныеЧисленности.ЧисленностьРаботниковЭПЗВнутреннихСовместителей = ДанныеОтчета.ЧисленностьРаботниковЭПЗВнутреннихСовместителей;	

КонецПроцедуры

Функция СформироватьДанныеССЧЭПЗ(Данные, Организация, ДатаНачала, ДатаОкончания, ИсключатьТяжелыеУсловияТруда = Ложь) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники")); 
	ТаблицаДанных.Колонки.Добавить("ВидЗанятости", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗанятости"));
	
	ТаблицаИтоговыхДанных = Новый ТаблицаЗначений;
	ТаблицаИтоговыхДанных.Колонки.Добавить("ВидЗанятости", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗанятости")); 
	ТаблицаИтоговыхДанных.Колонки.Добавить("Средняя", Новый ОписаниеТипов("Число")); 
	
	ЧисленностьРаботниковЭПЗВнешнихСовместителей = 0;
	ЧисленностьРаботниковЭПЗОсновыныхСотрудников = 0;
	ЧисленностьРаботниковЭПЗВнутреннихСовместителей = 0;
	
	Для Каждого СтрокаМесяца Из Данные.Строки Цикл
		Месяц = СтрокаМесяца.Месяц;    
		Для Каждого СтрокаСотрудника Из СтрокаМесяца.Строки Цикл 
			Если ИсключатьТяжелыеУсловияТруда
			И СтрокаСотрудника.ДолжностьТяжелыеУсловияТруда = ИСТИНА Тогда 
				Продолжить       
			Иначе	
				НоваяСтрока = ТаблицаДанных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСотрудника);
			КонецЕсли;	
		КонецЦикла;	                                            
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ВидЗанятости", Перечисления.ВидыЗанятости.Совместительство);
		
		МассивОтбора = ТаблицаДанных.НайтиСтроки(ПараметрыОтбора); 
		ТаблицаОтбора = ПреобразоватьМассивВТаблицу(МассивОтбора);
		ТаблицаДанныхДляВывода = СтатистикаПерсонала.ДанныеВремениДляРасчетаЭПЗ(ТаблицаОтбора, Организация, Месяц); 
		Для Каждого СтрокаДанных Из ТаблицаДанныхДляВывода Цикл
			Если Не СтрокаДанных.Норма = NULL И Не СтрокаДанных.Норма = 0 Тогда 
				НоваяСтрока = ТаблицаИтоговыхДанных.Добавить();
				НоваяСтрока.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство;
				НоваяСтрока.Средняя = Окр(СтрокаДанных.Работа/СтрокаДанных.Норма, 2)
			КонецЕсли;
		КонецЦикла; 
		ЧисленностьРаботниковЭПЗВнешнихСовместителей = ТаблицаИтоговыхДанных.Итог("Средняя"); 
		ТаблицаИтоговыхДанных.Очистить();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ВидЗанятости", Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);
		
		МассивОтбора = ТаблицаДанных.НайтиСтроки(ПараметрыОтбора); 
		ТаблицаОтбора = ПреобразоватьМассивВТаблицу(МассивОтбора);
		ТаблицаДанныхДляВывода = СтатистикаПерсонала.ДанныеВремениДляРасчетаЭПЗ(ТаблицаОтбора, Организация, Месяц); 
		Для Каждого СтрокаДанных Из ТаблицаДанныхДляВывода Цикл
			Если Не СтрокаДанных.Норма = NULL И Не СтрокаДанных.Норма = 0 Тогда 
				НоваяСтрока = ТаблицаИтоговыхДанных.Добавить();
				НоваяСтрока.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство;
				НоваяСтрока.Средняя = Окр(СтрокаДанных.Работа/СтрокаДанных.Норма, 2)
			КонецЕсли;
		КонецЦикла;
		ЧисленностьРаботниковЭПЗОсновыныхСотрудников = ТаблицаИтоговыхДанных.Итог("Средняя"); 
		ТаблицаИтоговыхДанных.Очистить();

		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ВидЗанятости", Перечисления.ВидыЗанятости.ВнутреннееСовместительство);
		
		МассивОтбора = ТаблицаДанных.НайтиСтроки(ПараметрыОтбора); 
		ТаблицаОтбора = ПреобразоватьМассивВТаблицу(МассивОтбора);
		ТаблицаДанныхДляВывода = СтатистикаПерсонала.ДанныеВремениДляРасчетаЭПЗ(ТаблицаОтбора, Организация, Месяц); 
		Для Каждого СтрокаДанных Из ТаблицаДанныхДляВывода Цикл
			Если Не СтрокаДанных.Норма = NULL И Не СтрокаДанных.Норма = 0 Тогда 
				НоваяСтрока = ТаблицаИтоговыхДанных.Добавить();
				НоваяСтрока.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство;
				НоваяСтрока.Средняя = Окр(СтрокаДанных.Работа/СтрокаДанных.Норма, 2)
			КонецЕсли;
		КонецЦикла; 
		ЧисленностьРаботниковЭПЗВнутреннихСовместителей = ТаблицаИтоговыхДанных.Итог("Средняя"); 
		ТаблицаИтоговыхДанных.Очистить();
	КонецЦикла;	 
	ДанныеОтчета = Новый Структура("ЧисленностьРаботниковЭПЗВнешнихСовместителей, ЧисленностьРаботниковЭПЗОсновыныхСотрудников, ЧисленностьРаботниковЭПЗВнутреннихСовместителей");
	ДанныеОтчета.ЧисленностьРаботниковЭПЗВнешнихСовместителей = ЧисленностьРаботниковЭПЗВнешнихСовместителей;
	ДанныеОтчета.ЧисленностьРаботниковЭПЗОсновыныхСотрудников = ЧисленностьРаботниковЭПЗОсновыныхСотрудников;  
	ДанныеОтчета.ЧисленностьРаботниковЭПЗВнутреннихСовместителей = ЧисленностьРаботниковЭПЗВнутреннихСовместителей;
	
	Возврат ДанныеОтчета;

КонецФункции   

Функция ПреобразоватьМассивВТаблицу(Массив)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Для Сч = 0 По Массив.Количество()-1 Цикл
		СтрокаТаблицы = Таблица.Добавить();  
		СтрокаТаблицы.Сотрудник = Массив[Сч].Сотрудник;
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Процедура СреднесписочнаяЧисленностьРаботающих10ПИ(Организация, НачалоПериода, КонецПериода, ДанныеЧисленности) Экспорт

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаОтчета", НачалоПериода);
	ПараметрыОтчета.Вставить("ДатаКонцаПериодаОтчета", КонецПериода);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаВыборки", НачалоПериода);
	
	// Получение данных отчета
	ДанныеОтчета = Новый ДеревоЗначений;
	СхемаКомпоновки = Отчеты.СтатистикаПерсонала.ПолучитьМакет("СхемаКомпоновкиДанныхКадры");
	
	ПараметрыОтчета.Вставить("Вариант", "СреднесписочнаяЧисленность");
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));

	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	Если СтрокаОрганизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧислоМесяцев = 12*(Год(НачалоПериода) - Год(КонецПериода)) + Месяц(КонецПериода) - Месяц(НачалоПериода) + 1;
	
	Если ЧислоМесяцев = 0 Тогда
		Возврат;
	КонецЕсли;	
	

	ДанныеЧисленности.ЧисленностьИнвалидов = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0,Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	ДанныеЧисленности.ЧисленностьРаботников = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));	
	ДанныеЧисленности.ЧисленностьЖенщин = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));
	ДанныеЧисленности.ЧисленностьМужчин = ДанныеЧисленности.ЧисленностьРаботников - ДанныеЧисленности.ЧисленностьЖенщин;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	КонтактнаяИнформацияФизлица.ЗначенияПолей КАК ЗначенияПолей
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|			ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК ФизическоеЛицо
	|		ИЗ
	|			Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|				ПО (ФизическиеЛицаКонтактнаяИнформация.Вид = ВидыКонтактнойИнформации.Ссылка)
	|					И (ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица))
	|					И (ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникФизическиеЛица))) КАК КонтактнаяИнформацияФизлица
	|		ПО Сотрудники.Ссылка.ФизическоеЛицо = КонтактнаяИнформацияФизлица.ФизическоеЛицо
	|ГДЕ
	|	Сотрудники.ГоловнаяОрганизация = &Организация
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
	мСельскиеЖители = Новый Массив;
	//++ ЕРП ЗИК
	Пока Выборка.Следующий() Цикл
		РезультатыЧтения = Новый Структура;
		XDTOКонтактная = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(Выборка.ЗначенияПолей, ТипКонтактнойИнформации, РезультатыЧтения);
		Если НЕ РезультатыЧтения.Свойство("ТекстОшибки") Тогда
			ПредставлениеИнформации = XDTOКонтактная.Состав;
			Адрес = Строка(ПредставлениеИнформации.Состав);		
			СтруктураАдреса = УправлениеКонтактнойИнформациейСлужебный.РазложитьАдресВСтруктуру(Адрес);
			Если НЕ СокрЛП(СтруктураАдреса.НаселенныйПункт) = "" Тогда
				мСельскиеЖители.Добавить(Выборка.Сотрудник);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	//~Пока Выборка.Следующий() Цикл
	//~	Адрес = Выборка.ЗначенияПолей;
	//~	СтруктураАдреса = РаботаСАдресами.СведенияОбАдресе(Адрес);
	//~	Если НЕ СокрЛП(СтруктураАдреса.НаселенныйПункт) = "" Тогда
	//~		мСельскиеЖители.Добавить(Выборка.Сотрудник);
	//~	КонецЕсли;
	//~КонецЦикла;	

	//-- ЕРП ЗИК
	ПараметрыОтчета.Вставить("мСельскиеЖители", мСельскиеЖители);
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьПроживающихВСелах = 0;
	ЧисленностьПроживающихВГородах = 0;
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьПроживающихВСелах = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));	
		ДанныеЧисленности.ЧисленностьЖенщинПроживающихВСелах = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));	
	КонецЕсли;	
	ЧисленностьПроживающихВГородах = ДанныеЧисленности.ЧисленностьРаботников - ЧисленностьПроживающихВСелах;
	ДанныеЧисленности.ЧисленностьМужчинПроживающихВСелах = ЧисленностьПроживающихВСелах - ДанныеЧисленности.ЧисленностьЖенщинПроживающихВСелах;
	ДанныеЧисленности.ЧисленностьЖенщинПроживающихВГородах = ДанныеЧисленности.ЧисленностьЖенщин - ДанныеЧисленности.ЧисленностьЖенщинПроживающихВСелах;
	ДанныеЧисленности.ЧисленностьМужчинПроживающихВГородах = ДанныеЧисленности.ЧисленностьМужчин - ДанныеЧисленности.ЧисленностьМужчинПроживающихВСелах;
	
	ПараметрыОтчета.Удалить("мСельскиеЖители");
	
	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -18*12)));
	ПараметрыОтчета.Вставить("ОкончаниеИнтервала", НачалоГода(ДобавитьМесяц(КонецПериода, -35*12)));
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьРаботниковОт18До35 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьРаботниковОт18До35 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));
		ДанныеЧисленности.ЧисленностьЖенщинОт18До35 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));
	КонецЕсли;
	ДанныеЧисленности.ЧисленностьМужчинОт18До35 = ЧисленностьРаботниковОт18До35 - ДанныеЧисленности.ЧисленностьЖенщинОт18До35;

	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -36*12)));
	ПараметрыОтчета.Вставить("ОкончаниеИнтервала", НачалоГода(ДобавитьМесяц(КонецПериода, -60*12)));
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьРаботниковОт36До60 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьРаботниковОт36До60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));
		ДанныеЧисленности.ЧисленностьЖенщинОт36До60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));
	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинОт36До60 = ЧисленностьРаботниковОт36До60 - ДанныеЧисленности.ЧисленностьЖенщинОт36До60;

	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -61*12)));
	ПараметрыОтчета.Удалить("ОкончаниеИнтервала");
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьРаботниковОт60 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьРаботниковОт60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));
		ДанныеЧисленности.ЧисленностьЖенщинОт60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));

	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинОт60 = ЧисленностьРаботниковОт60 - ДанныеЧисленности.ЧисленностьЖенщинОт60;

	ПараметрыОтчета.Вставить("Пол", Перечисления.ПолФизическогоЛица.Женский);
	ПараметрыОтчета.Удалить("НачалоИнтервала");

	// Получение данных отчета
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ДанныеЧисленности.ЧисленностьЖенщинИнвалидов = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинИнвалидов = ДанныеЧисленности.ЧисленностьИнвалидов - ДанныеЧисленности.ЧисленностьЖенщинИнвалидов;
	
	ПараметрыОтчета.Вставить("мСельскиеЖители", мСельскиеЖители);
	ПараметрыОтчета.Удалить("Пол");
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьИнвалидовПроживающихВСелах = 0;
	ЧисленностьИнвалидовПроживающихВГородах = 0;
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьИнвалидовПроживающихВСелах = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));	
	КонецЕсли;	
	ЧисленностьИнвалидовПроживающихВГородах = ДанныеЧисленности.ЧисленностьИнвалидов - ЧисленностьИнвалидовПроживающихВСелах;
	ПараметрыОтчета.Вставить("Пол", Перечисления.ПолФизическогоЛица.Женский);
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ДанныеЧисленности.ЧисленностьЖенщинИнвалидовПроживающихВСелах = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинИнвалидовПроживающихВСелах = ЧисленностьИнвалидовПроживающихВСелах - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовПроживающихВСелах;
	ДанныеЧисленности.ЧисленностьЖенщинИнвалидовПроживающихВГородах = ДанныеЧисленности.ЧисленностьЖенщинИнвалидов - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовПроживающихВСелах;
	ДанныеЧисленности.ЧисленностьМужчинИнвалидовПроживающихВГородах = ЧисленностьИнвалидовПроживающихВГородах - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовПроживающихВГородах;
	ПараметрыОтчета.Удалить("мСельскиеЖители");
	ПараметрыОтчета.Удалить("Пол");
	
	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -18*12)));
	ПараметрыОтчета.Вставить("ОкончаниеИнтервала", НачалоГода(ДобавитьМесяц(КонецПериода, -35*12)));
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки, 
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьРаботниковИнвалидовОт18До35 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьРаботниковИнвалидовОт18До35= ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	

	ПараметрыОтчета.Вставить("Пол", Перечисления.ПолФизическогоЛица.Женский);

	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт18До35 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинИнвалидовОт18До35 = ЧисленностьРаботниковИнвалидовОт18До35 - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт18До35;
	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -36*12)));
	ПараметрыОтчета.Вставить("ОкончаниеИнтервала", НачалоГода(ДобавитьМесяц(КонецПериода, -60*12)));
	ПараметрыОтчета.Удалить("Пол");
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьИнвалидовОт36До60 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьИнвалидовОт36До60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	

	ПараметрыОтчета.Вставить("Пол", Перечисления.ПолФизическогоЛица.Женский);

	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт36До60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;
	ДанныеЧисленности.ЧисленностьМужчинИнвалидовОт36До60 = ЧисленностьИнвалидовОт36До60 - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт36До60;
	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -61*12)));
	ПараметрыОтчета.Удалить("ОкончаниеИнтервала");
	ПараметрыОтчета.Удалить("Пол");
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьИнвалидовОт60 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьИнвалидовОт60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	

	ПараметрыОтчета.Вставить("Пол", Перечисления.ПолФизическогоЛица.Женский);

	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинИнвалидовОт60 = ЧисленностьИнвалидовОт60 - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт60;

КонецПроцедуры

Процедура СписочнаяЧисленностьРаботающих(Организация, ДатаАктуальности, ДанныеЧисленности) Экспорт

	
КонецПроцедуры

Процедура ДанныеДляЗаполненияРегламентированнойОтчетностиКадры(Вариант, ПараметрыОтчета, ДанныеОтчета)
	
	СхемаКомпоновки = Отчеты.СтатистикаПерсонала.ПолучитьМакет("СхемаКомпоновкиДанныхКадры");
	
	ПараметрыОтчета.Вставить("Вариант", Вариант);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиОтчета = ЗаполнитьКомпоновщикНастроек(Вариант, ПараметрыОтчета, СхемаКомпоновки.ВариантыНастроек[Вариант].Настройки);
	
	// Запрос данных
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
		НастройкиОтчета, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Процедура ДанныеДляЗаполненияРегламентированнойОтчетностиКадрыЭПЗ(Вариант, ПараметрыОтчета, ДанныеОтчета)
	
	СхемаКомпоновки = Отчеты.СтатистикаПерсонала.ПолучитьМакет("СхемаКомпоновкиДанныхКадры");
	
	ПараметрыОтчета.Вставить("Вариант", Вариант);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиОтчета = ЗаполнитьКомпоновщикНастроекЭПЗ(Вариант, ПараметрыОтчета, СхемаКомпоновки.ВариантыНастроек[Вариант].Настройки);
	
	// Запрос данных
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
		НастройкиОтчета, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

Функция ЗаполнитьКомпоновщикНастроекЭПЗ(Вариант, ПараметрыОтчета, НастройкиВарианта)
	
	Организация = ПараметрыОтчета.Организация;
	ДатаНачалаПериодаОтчета = ПараметрыОтчета.ДатаНачалаПериодаОтчета;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", Вариант);
	
	ПараметрПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");
	Если ПараметрПериод = Неопределено Тогда
		ПараметрПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериодОтчета");
	КонецЕсли;
	ПараметрПериод.Значение.ДатаНачала = ДатаНачалаПериодаОтчета;
	ПараметрПериод.Значение.ДатаОкончания = ДатаКонцаПериодаОтчета; 
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Отбор = Настройки.Отбор;
	Отбор.Элементы.Очистить();
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Организация", ВидСравненияКомпоновкиДанных.Равно, ПараметрыОтчета.Организация);
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();
	
КонецФункции

Процедура ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ(Вариант, СхемаКомпоновки, ПараметрыОтчета, ДанныеОтчета)
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиОтчета = ЗаполнитьКомпоновщикНастроек10ПИ(Вариант, ПараметрыОтчета, СхемаКомпоновки.ВариантыНастроек[Вариант].Настройки);
	
	// Запрос данных
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
		НастройкиОтчета, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Функция ЗаполнитьКомпоновщикНастроек(Вариант, ПараметрыОтчета, НастройкиВарианта)
	
	Организация = ПараметрыОтчета.Организация;
	ДатаНачалаПериодаОтчета = ПараметрыОтчета.ДатаНачалаПериодаВыборки;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	ИсключатьПериодыПоПравилам1ПВ = ПараметрыОтчета.ИсключатьПериодыПоПравилам1ПВ; 

	// Настройка отборов
	ИсключитьДанныеОбособленныхПодразделений = Ложь;
	Если Не ПараметрыОтчета.Свойство("ИсключитьДанныеОбособленныхПодразделений", ИсключитьДанныеОбособленныхПодразделений) Тогда
		ИсключитьДанныеОбособленныхПодразделений = Ложь
	КонецЕсли;
	
	Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	Если Не ПараметрыОтчета.Свойство("ОбособленноеПодразделение", Подразделение) Тогда
		Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка()
	КонецЕсли;
	
	МассивПодразделений = ПодразделенияИсключения(Организация, Подразделение, ИсключитьДанныеОбособленныхПодразделений);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", Вариант);
	
	ПараметрПериод = ОтчетыКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");
	Если ПараметрПериод = Неопределено Тогда
		ПараметрПериод = ОтчетыКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериодОтчета");
	КонецЕсли;
	ПараметрПериод.Значение.ДатаНачала = ДатаНачалаПериодаОтчета;
	ПараметрПериод.Значение.ДатаОкончания = ДатаКонцаПериодаОтчета;

	ПараметрИсключатьПериодыПоПравилам1ПВ = ОтчетыКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ИсключатьПериодыПоПравилам1ПВ");
    ПараметрИсключатьПериодыПоПравилам1ПВ.Значение = ИсключатьПериодыПоПравилам1ПВ;

	Если ПараметрыОтчета.Свойство("СНачалаГода") Тогда
		ПараметрСНачалаГода = ОтчетыКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СНачалаГода");
		Если ПараметрСНачалаГода <> Неопределено Тогда
			ПараметрСНачалаГода.Значение = ПараметрыОтчета.СНачалаГода;
		КонецЕсли;
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Отбор = Настройки.Отбор;
	Отбор.Элементы.Очистить();
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Организация", ВидСравненияКомпоновкиДанных.Равно, Организация);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Подразделение", ВидСравненияКомпоновкиДанных.ВСписке, МассивПодразделений);
	КонецЕсли;
	Если ИсключитьДанныеОбособленныхПодразделений Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Подразделение", ВидСравненияКомпоновкиДанных.НеВСписке, МассивПодразделений);
	КонецЕсли;
	
	// Далее следует настройка варианта расшифровки.
	Если Вариант <> "Расшифровка" Тогда
		Возврат КомпоновщикНастроек.ПолучитьНастройки();
	КонецЕсли;
	
	НомерСтроки = ПараметрыОтчета.НомерСтроки;
	НомерКолонки = ПараметрыОтчета.НомерКолонки;
	
	ВидОтчета = ПараметрыОтчета.ВидОтчета;
	
	// Включение полей отчета, по которым выводится расшифровка.
	ВключитьВычисляемоеПоле(Настройки.Выбор, "Сотрудник");
	
	ВариантРасчетаПоказателей = ?(ПараметрыОтчета.Свойство("ВариантРасчетаПоказателей"), ПараметрыОтчета.ВариантРасчетаПоказателей, 0);
	//ОпределитьВидСКД(ВидОтчета, НомерКолонки, ВариантРасчетаПоказателей, Настройки);
	
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();
	
КонецФункции
Функция ЗаполнитьКомпоновщикНастроек10ПИ(Вариант, ПараметрыОтчета, НастройкиВарианта)
	
	Организация = ПараметрыОтчета.Организация;
	ДатаНачалаПериодаОтчета = ПараметрыОтчета.ДатаНачалаПериодаВыборки;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	
	// Настройка отборов
		
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", Вариант);
	
	ПараметрПериод = ОтчетыКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");
	Если ПараметрПериод = Неопределено Тогда
		ПараметрПериод = ОтчетыКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериодОтчета");
	КонецЕсли;
	ПараметрПериод.Значение.ДатаНачала = ДатаНачалаПериодаОтчета;
	ПараметрПериод.Значение.ДатаОкончания = ДатаКонцаПериодаОтчета;
	
	Если ПараметрыОтчета.Свойство("СНачалаГода") Тогда
		ПараметрСНачалаГода = ОтчетыКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СНачалаГода");
		Если ПараметрСНачалаГода <> Неопределено Тогда
			ПараметрСНачалаГода.Значение = ПараметрыОтчета.СНачалаГода;
		КонецЕсли;
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Отбор = Настройки.Отбор;
	Отбор.Элементы.Очистить();
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Организация", ВидСравненияКомпоновкиДанных.Равно, Организация);
	
	Если ПараметрыОтчета.Свойство("Пол") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.Пол", ВидСравненияКомпоновкиДанных.Равно, Перечисления.ПолФизическогоЛица.Женский);
	КонецЕсли;
	Если ПараметрыОтчета.Свойство("мСельскиеЖители") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник", ВидСравненияКомпоновкиДанных.ВСписке, ПараметрыОтчета.мСельскиеЖители);
	КонецЕсли;
	
	Если ПараметрыОтчета.Свойство("НачалоИнтервала") И ПараметрыОтчета.Свойство("ОкончаниеИнтервала") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.ДатаРождения", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ПараметрыОтчета.НачалоИнтервала);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.ДатаРождения", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ПараметрыОтчета.ОкончаниеИнтервала);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.ДатаРождения", ВидСравненияКомпоновкиДанных.НеРавно, Дата(1,1,1,0,0,0));
	КонецЕсли;
	Если ПараметрыОтчета.Свойство("НачалоИнтервала") И НЕ ПараметрыОтчета.Свойство("ОкончаниеИнтервала") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.ДатаРождения", ВидСравненияКомпоновкиДанных.Меньше, ПараметрыОтчета.НачалоИнтервала);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.ДатаРождения", ВидСравненияКомпоновкиДанных.НеРавно, Дата(1,1,1,0,0,0));
	КонецЕсли;
	// Далее следует настройка варианта расшифровки.
	Если Вариант <> "Расшифровка" Тогда
		Возврат КомпоновщикНастроек.ПолучитьНастройки();
	КонецЕсли;
	
	НомерСтроки = ПараметрыОтчета.НомерСтроки;
	НомерКолонки = ПараметрыОтчета.НомерКолонки;
	
	ВидОтчета = ПараметрыОтчета.ВидОтчета;
	
	// Включение полей отчета, по которым выводится расшифровка.
	ВключитьВычисляемоеПоле(Настройки.Выбор, "Сотрудник");
	
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();
	
КонецФункции
Процедура ВключитьВычисляемоеПоле(ВыбранныеПоля, ИмяПоля)
	
	Если Лев(ИмяПоля, 20) = "ПользовательскиеПоля" Тогда
		ИмяПоля = СтрЗаменить(ИмяПоля, "ПользовательскиеПоля", "ПользовательскиеПоля.");
	КонецЕсли;
	
	ИскомоеПоле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	Для Каждого НастройкаПоля Из ВыбранныеПоля.Элементы Цикл
		Если НастройкаПоля.Поле = ИскомоеПоле Тогда
			НастройкаПоля.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПодразделенияИсключения(Организация, Подразделение, ИсключитьДанныеОбособленныхПодразделений)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Если ИсключитьДанныеОбособленныхПодразделений  Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ПОМЕСТИТЬ ВТПодразделенияВерхнегоУровня
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Владелец = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ПодразделенияВерхнегоУровня.Ссылка
		|			ИЗ
		|				ВТПодразделенияВерхнегоУровня КАК ПодразделенияВерхнегоУровня)
		|	И ПодразделенияОрганизаций.Владелец = &Организация";
		ПустыеКоды = Новый Массив;
		ПустыеКоды.Добавить("");
		ПустыеКоды.Добавить("              ");
		Запрос.УстановитьПараметр("ПустыеКоды", ПустыеКоды);
		
	ИначеЕсли ЗначениеЗаполнено(Подразделение) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ(&Подразделение)
		|	И ПодразделенияОрганизаций.Владелец = &Организация";
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		
	Иначе
		
		Возврат Новый Массив
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции 

//Повертає дані часу для розрахунку еквівалента повної зайнятості
//
Функция ДанныеВремениДляРасчетаЭПЗ(ТаблицаСотрудников, Организация, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Сотрудники", ТаблицаСотрудников);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Период));
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Сотрудник,
	|	&Период КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(&Период, МЕСЯЦ) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|  	&Сотрудники КАК Сотрудники";
	
	Запрос.Выполнить();
	
	ПараметрыЗаполнения = УчетРабочегоВремени.ПараметрыДляЗапросВТДанныеУчетаВремениИСостоянийСотрудников();
		
	ПараметрыЗаполнения.ИмяВТСотрудники = "ВТСотрудники";
	ПараметрыЗаполнения.ИмяВТРезультат = "ВТДанныеУчетаВремениИСостоянийСотрудников";
	ПараметрыЗаполнения.РассчитыватьПлановоеВремя = Истина;
	ПараметрыЗаполнения.Организация  = Организация;
	ПараметрыЗаполнения.ДатаАктуальности  = КонецМесяца(Период);
	ПараметрыЗаполнения.ДатаНачала = НачалоМесяца(Период);
	ПараметрыЗаполнения.ДатаОкончания = КонецМесяца(Период);
			
	ПараметрыЗаполнения.МесяцДатаНачала = НачалоМесяца(Период);
	ПараметрыЗаполнения.МесяцДатаОкончания = КонецМесяца(Период);
			
	ПараметрыЗаполнения.ПолучатьУжеРассчитанныеДанные = Ложь;
	ПараметрыЗаполнения.ПолучатьУсловияТрудаИТерритории = Ложь;
			
	УчетРабочегоВремени.СоздатьВТДанныеУчетаВремениИСостоянийСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыЗаполнения);	
	
	МассивВидыВремениЧасы = Новый Массив();
	//Види відпрацьованого часу, окрім понаднормових
	МассивВидыВремениЧасы.Добавить(Справочники.ВидыИспользованияРабочегоВремени.Явка);
	МассивВидыВремениЧасы.Добавить(Справочники.ВидыИспользованияРабочегоВремени.РаботаВРежимеНеполногоВремени);
	МассивВидыВремениЧасы.Добавить(Справочники.ВидыИспользованияРабочегоВремени.РаботаВечерниеЧасы);
	МассивВидыВремениЧасы.Добавить(Справочники.ВидыИспользованияРабочегоВремени.РаботаНочныеЧасы);
	МассивВидыВремениЧасы.Добавить(Справочники.ВидыИспользованияРабочегоВремени.Праздники);
	Попытка
		МассивВидыВремениЧасы.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ПраздникиБезПовышеннойОплаты);
	Исключение
	КонецПопытки;	
	МассивВидыВремениЧасы.Добавить(Справочники.ВидыИспользованияРабочегоВремени.Командировка);
	МассивВидыВремениЧасы.Добавить(Справочники.ВидыИспользованияРабочегоВремени.СокращенноеРабочееВремя);
	
	МассивВидыВремениНорма = Новый Массив();
	//Невідпрацьований час з оплатою, беруться години за нормою графіку
	МассивВидыВремениНорма.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ДополнительныйОтпуск);
	МассивВидыВремениНорма.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ОсновнойОтпуск);
	МассивВидыВремениНорма.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ОтпускНаДетей);
	МассивВидыВремениНорма.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ОтпускНаОбучение);
	МассивВидыВремениНорма.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ЧернобыльскийОтпуск);
	МассивВидыВремениНорма.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ТворческийОтпуск);
	МассивВидыВремениНорма.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ГосударственныеОбязанности);
	
	МассивИсключаемыеСостояния = Новый Массив();
	//Стани, без оплати але з потрібним видом часу, треба виключити додатково
	МассивИсключаемыеСостояния.Добавить(Перечисления.СостоянияСотрудника.МобилизацияБезОплаты);
	
	Запрос.УстановитьПараметр("МассивВидыВремениЧасы", МассивВидыВремениЧасы);
	Запрос.УстановитьПараметр("МассивВидыВремениНорма", МассивВидыВремениНорма);
	Запрос.УстановитьПараметр("МассивИсключаемыеСостояния", МассивИсключаемыеСостояния);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияСотрудников.Сотрудник,
	|	СостоянияСотрудников.НачалоПериода,
	|	СостоянияСотрудников.ОкончаниеПериода
	|ПОМЕСТИТЬ ВТИсключаемыеСостояния
	|ИЗ
	|  	ВТСостоянияСотрудников КАК СостоянияСотрудников
	|ГДЕ
	|	СостоянияСотрудников.Состояние В (&МассивИсключаемыеСостояния)
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеУчетаВремениИСостоянийСотрудников.Сотрудник,
	|	ДанныеУчетаВремениИСостоянийСотрудников.ВидУчетаВремени,
	|	ДанныеУчетаВремениИСостоянийСотрудников.Дата,
	|	ВЫБОР
	|   	КОГДА ИсключаемыеСостояния.Сотрудник ЕСТЬ NULL
	|			ТОГДА ДанныеУчетаВремениИСостоянийСотрудников.Часы
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часы,
	|	ВЫБОР
	|   	КОГДА ИсключаемыеСостояния.Сотрудник ЕСТЬ NULL
	|			ТОГДА ДанныеУчетаВремениИСостоянийСотрудников.НормаЧасов
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НормаЧасов
	|ПОМЕСТИТЬ ВТДанныеУчетаВремениИСостоянийСотрудниковСФильтром
	|ИЗ
	|  	ВТДанныеУчетаВремениИСостоянийСотрудников КАК ДанныеУчетаВремениИСостоянийСотрудников
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТИсключаемыеСостояния КАК ИсключаемыеСостояния
	|	ПО ДанныеУчетаВремениИСостоянийСотрудников.Сотрудник =  ИсключаемыеСостояния.Сотрудник
	|	И ДанныеУчетаВремениИСостоянийСотрудников.Дата >= ИсключаемыеСостояния.НачалоПериода
	|	И ДанныеУчетаВремениИСостоянийСотрудников.Дата <= ИсключаемыеСостояния.ОкончаниеПериода
	|;
	|
	|ВЫБРАТЬ
	|	ДанныеУчетаВремениИСостоянийСотрудников.Сотрудник,
	|	СУММА(ВЫБОР
	|   	КОГДА ДанныеУчетаВремениИСостоянийСотрудников.ВидУчетаВремени В (&МассивВидыВремениЧасы)
	|			ТОГДА ДанныеУчетаВремениИСостоянийСотрудников.Часы
	|       КОГДА ДанныеУчетаВремениИСостоянийСотрудников.ВидУчетаВремени В (&МассивВидыВремениНорма)
	|			ТОГДА ДанныеУчетаВремениИСостоянийСотрудников.НормаЧасов
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Работа
	|ПОМЕСТИТЬ ВТЭПЗ_Работа
	|ИЗ
	|  	ВТДанныеУчетаВремениИСостоянийСотрудниковСФильтром КАК ДанныеУчетаВремениИСостоянийСотрудников
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУчетаВремениИСостоянийСотрудников.Сотрудник
	|;
	|
	|ВЫБРАТЬ
	|	ПериодыДейсвияОбщихГрафиковСотрудников.Сотрудник,
	|   МИНИМУМ(ПериодыДейсвияОбщихГрафиковСотрудников.ДатаНачала) КАК ДатаМинимум,
	|	МАКСИМУМ(ПериодыДейсвияОбщихГрафиковСотрудников.ДатаОкончания) КАК ДатаМаксимум
	|ПОМЕСТИТЬ ВТЭПЗ_ПериодыГрафиковМинМакс
	|ИЗ
	|  	ВТПериодыДейсвияОбщихГрафиковСотрудников КАК ПериодыДейсвияОбщихГрафиковСотрудников
	|СГРУППИРОВАТЬ ПО
	|	ПериодыДейсвияОбщихГрафиковСотрудников.Сотрудник
	|;
	|
	|ВЫБРАТЬ
	|	ПериодыДейсвияОбщихГрафиковСотрудников.Сотрудник,
	|	ПериодыДейсвияОбщихГрафиковСотрудников.ГрафикРаботыНорма,
	|   ВЫБОР 
	|		КОГДА ПериодыДейсвияОбщихГрафиковСотрудников.ДатаНачала = ПериодыГрафиковМинМакс.ДатаМинимум
	|			ТОГДА НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
	|       	ИНАЧЕ ПериодыДейсвияОбщихГрафиковСотрудников.ДатаНачала 
	|   КОНЕЦ КАК ДатаНачала, 
	|   ВЫБОР 
	|		КОГДА ПериодыДейсвияОбщихГрафиковСотрудников.ДатаОкончания = ПериодыГрафиковМинМакс.ДатаМаксимум
	|			ТОГДА КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|       	ИНАЧЕ ПериодыДейсвияОбщихГрафиковСотрудников.ДатаОкончания 
	|   КОНЕЦ КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТЭПЗ_ПериодыГрафиков
	|ИЗ
	|  	ВТПериодыДейсвияОбщихГрафиковСотрудников КАК ПериодыДейсвияОбщихГрафиковСотрудников
	|   ЛЕВОЕ СОЕДИНЕНИЕ
	|   ВТЭПЗ_ПериодыГрафиковМинМакс КАК ПериодыГрафиковМинМакс 
	|   ПО ПериодыДейсвияОбщихГрафиковСотрудников.Сотрудник = ПериодыГрафиковМинМакс.Сотрудник
	|;
	|
	|ВЫБРАТЬ
	|	ПериодыГрафиков.Сотрудник,
	|   СУММА(ДанныеОбщихГрафиков.Часов) КАК Норма
	|ПОМЕСТИТЬ ВТЭПЗ_Норма
	|ИЗ
	|  	ВТЭПЗ_ПериодыГрафиков КАК ПериодыГрафиков
	|   ЛЕВОЕ СОЕДИНЕНИЕ
	|   ВТДанныеОбщихГрафиков КАК ДанныеОбщихГрафиков 
	|   ПО ПериодыГрафиков.ГрафикРаботыНорма = ДанныеОбщихГрафиков.ГрафикРаботы
	|    И ПериодыГрафиков.ДатаНачала <= ДанныеОбщихГрафиков.Дата
	|    И ПериодыГрафиков.ДатаОкончания >= ДанныеОбщихГрафиков.Дата
	|СГРУППИРОВАТЬ ПО
	|	ПериодыГрафиков.Сотрудник
	|;
	|
	|ВЫБРАТЬ
	|	НормаВремени.Сотрудник,
	|   СУММА(НормаВремени.ЧасыПлан) КАК Норма
	|ПОМЕСТИТЬ ВТЭПЗ_Норма2
	|ИЗ
	|  	ВТНормаВремени КАК НормаВремени
	|СГРУППИРОВАТЬ ПО
	|	НормаВремени.Сотрудник
	|;
	|
	|ВЫБРАТЬ
	|	Сотрудники.Сотрудник,
	|   ДанныеРабота.Работа КАК Работа,
	|   ЕСТЬNULL(ДанныеНорма.Норма, ЕСТЬNULL(ДанныеНорма2.Норма,0))	КАК Норма
	|ИЗ
	|  	ВТСотрудники КАК Сотрудники
	|   ЛЕВОЕ СОЕДИНЕНИЕ
	|   ВТЭПЗ_Работа КАК ДанныеРабота 
	|   ПО Сотрудники.Сотрудник = ДанныеРабота.Сотрудник
	|   ЛЕВОЕ СОЕДИНЕНИЕ
	|   ВТЭПЗ_Норма КАК ДанныеНорма 
	|   ПО Сотрудники.Сотрудник = ДанныеНорма.Сотрудник
	|   ЛЕВОЕ СОЕДИНЕНИЕ
	|   ВТЭПЗ_Норма2 КАК ДанныеНорма2 
	|   ПО Сотрудники.Сотрудник = ДанныеНорма2.Сотрудник";

	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Чтение настроек подсистемы статистики персонала.
// Если формирование отчетных форм статистики отключено, функция возвращает
// структуру с единственным реквизитом ИспользоватьОтчетностьМониторингаРаботниковСоциальнойСферы,
// установленным в значение ЛОЖЬ.
//
// ВозвращаемоеЗначение:
//  Структура настроек
//
Функция НастройкиСтатистикиПерсонала() Экспорт

	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИспользоватьОтчетностьМониторингаРаботниковСоциальнойСферы", Ложь);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтчетностьМониторингаРаботниковСоциальнойСферы") Тогда
		Возврат СтруктураНастроек;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НастройкиСтатистикиПерсонала.ИспользоватьОтчетностьМониторингаРаботниковСоциальнойСферы,
		|	НастройкиСтатистикиПерсонала.ФормаОтчетностиМониторингаРаботниковСоциальнойСферы
		|ИЗ
		|	РегистрСведений.НастройкиСтатистикиПерсонала КАК НастройкиСтатистикиПерсонала";

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Если РезультатЗапроса.Количество() > 0 Тогда
		СтруктураНастроек = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса[0]);
	КонецЕсли;
	
	Возврат СтруктураНастроек;

КонецФункции

Процедура УстановитьПустоеЗначение(Значение, ИмяЯчейки, Контейнер) Экспорт
	Если Контейнер.ПолеТабличногоДокументаФормаОтчета.Свойство(ИмяЯчейки) И (Значение = 0 Или Значение = Null) Тогда
		Контейнер.ПолеТабличногоДокументаФормаОтчета[ИмяЯчейки] = "ЧН=-";
	КонецЕсли;		
КонецПроцедуры

Процедура УстановитьПустоеЗначениеЧисленности(Значение, ИмяЯчейки, Контейнер) Экспорт
	Если Контейнер.ПолеТабличногоДокументаФормаОтчета.Свойство(ИмяЯчейки) И (Значение = Null Или Значение < 0.1) Тогда
		Контейнер.ПолеТабличногоДокументаФормаОтчета[ИмяЯчейки] = "ЧН=-";
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Блок функций первоначального заполнения и обновления ИБ.

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	

КонецПроцедуры

#КонецОбласти
